C Файл GET_STAR.for
C Содержит подпрограмму GET_STAR
C =============================================================
C формирование массива КЭ, сост-щих звезду оптимизируемого КЭ
C Вызывается из REGULARIZATION, вызываемых модулей нет
C =============================================================
C  входные параметры:
C    IND  - номер рассматриваемого узла
C    NOPT - массив номеров узлов, сост-щих элементы
C    NUMOFELT - число элементов
C  выходные параметры:
C    ITSTAR - массив номеров узлов, сост-щих элементы звезды
C    NSTAREL  - число элементов звезды
C =============================================================
C =============== начало кода GET_STAR ========================= 
C =============================================================
      subroutine GET_STAR(IND,NOPT,NUMOFELT,ITSTAR,NSTAREL)

      DIMENSION ITSTAR(100),NOPT(1)
      INTEGER INDEL,NODELS,JGT
      DATA NODELS/3/
      
      JGT=1
* перебираем все эл-ты
* если узел эл-та = оптимизируемому узлу, то запоминаем эл-т
      DO INDEL=1,NUMOFELT
       IF(NOPT(NODELS*(INDEL-1)+1).EQ.IND.OR.
     >    NOPT(NODELS*(INDEL-1)+2).EQ.IND.OR.
     >    NOPT(NODELS*(INDEL-1)+3).EQ.IND)THEN
        ITSTAR(NODELS*(JGT-1)+1)=NOPT(NODELS*(INDEL-1)+1)
        ITSTAR(NODELS*(JGT-1)+2)=NOPT(NODELS*(INDEL-1)+2)
        ITSTAR(NODELS*(JGT-1)+3)=NOPT(NODELS*(INDEL-1)+3)
        JGT=JGT+1
       ENDIF
      ENDDO
* запоминаем число элементов звезды
      NSTAREL=JGT-1
      END
C / END GET_STAR /
C =============================================================
C ====================== конец кода GET_STAR ====================
C =============================================================
C конец файла GET_STAR.for