C----------------------------------------------------------------------------
C       файл MEMCNT.FOR
C============================================================================
C       МОДУЛЬ РАСЧЕТА ЗАТРАТ ПАМЯТИ РАЗЛИЧНЫХ СХЕМ ХРАНЕНИЯ
C============================================================================
C       Вызывается из RENMDD
C       Вызывает  SMBFCT
C       Парамонов М.В. - 2012 - 
C----------------------------------------------------------------------------
C       Входные параметры:
C               NP - кол-во узлов
C               XADJ - индексный вектор структуры смежности графа
C               ADJNCY - структура смежности графа
C               PERM - вектор упорядоченности
C               INVP - вектор обратный PERM
C----------------------------------------------------------------------------
        SUBROUTINE MEMCNT (NP,XADJ,ADJNCY,PERM,INVP)
        INTEGER NP,XADJ(1),ADJNCY(1),PERM(1),INVP(1)
        INTEGER XLNZ(NP+1),MAXLNZ,XNZSUB(NP+1),NZSUB(500000),
     >  MAXSUB,RCHLNK(NP),MRGLNK(NP),XMARKER(NP),XFLAG
        INTEGER XENV(6000),ENVSZE,BANDW,NZMTX
        INTEGER PR/' '/,STR,ZV/'*'/,NI/'0'/,count,NPC,PL/'+'/
        DIMENSION STR(1000)
        
        MAXSUB=500000
        NPC=NP
C----------------------------------------------------------------------------
C       Подсчет кол-ва ненулевых элементов нижнего треугольника матрицы А
        NZMTX=0
        DO 100 I=1,NP
           ASTRT=XADJ(I)
           ASTOP=XADJ(I+1)-1
           IF (ASTRT.GT.ASTOP) GOTO 300
           DO 200 J=ASTRT,ASTOP
              IF (ADJNCY(J).LT.I) NZMTX=NZMTX+1
200        CONTINUE
100     CONTINUE 
C----------------------------------------------------------------------------
C       Распечатка матрицы А (1000 строк)
        WRITE (6,201)
201     FORMAT (100('-'),/,20X,'МАТРИЦА А (МАКСИМУМ 1000 СТРОК)',/,
     >   22X,'* - ненулевой элемент')
300     IF (NP.GT.1000) NPC=1000
        DO 400 I=1,NPC
           DO 401 J=1,NPC
              STR(J)= PR
              IF (I.EQ.J) STR(J)=ZV
              JSTRT=XADJ(PERM(I))
              JSTOP=XADJ(PERM(I)+1)-1
              IF(JSTOP.LT.JSTRT) GOTO 400
              DO 402 K=JSTRT,JSTOP  
                 IF (INVP(ADJNCY(K)).EQ.J.AND.
     >                   INVP(ADJNCY(K)).LT.I) STR(J)=ZV
402           CONTINUE      
401        CONTINUE
           WRITE(6,403) I,(STR(II),II=1,NPC)
400     CONTINUE      
403     FORMAT(5x,I5,'|',1000(A1,' '))      
C-----------------------------------------------------------------------------  
C       Символическое разложение (получение заполняемость мн-ля L и структуру компактной схемы)        
        CALL SMBFCT (NP, XADJ, ADJNCY, PERM, INVP,
     >    XLNZ, MAXLNZ, XNZSUB, NZSUB, MAXSUB,
     >    RCHLNK, MRGLNK, XMARKER, XFLAG )
C-----------------------------------------------------------------------------
C       Распечатка мн-ля L(1000 строк)
        WRITE (6,507)
507     FORMAT (100('-'),
     >   /,20X,'МНОЖИТЕЛЬ L (МАКСИМУМ 1000 СТРОК)',/,
     >   22X,'* - ненулевой элемент мн-ля L',/,
     >   22X,'+ - ненулевые элементы появившиеся при разложении')       
        DO 500 I=1,NPC
           DO 501 J=1,NPC
              STR(J)= PR
              IF (I.EQ.J) STR(J)=ZV
              JSTRT=XLNZ(J)    !доступ в компактной схеме
              JSTOP=XLNZ(J+1)-1              
              IF(JSTOP.LT.JSTRT) GOTO 501
                  KSUB = XNZSUB(J)
                  DO 502 K=JSTRT,JSTOP  
                     IF (NZSUB(KSUB).EQ.I) GOTO 504
                     KSUB=KSUB+1
502               CONTINUE
               GOTO 501
504            STR(J)=PL 
               JSTRT=XADJ(PERM(I))
               JSTOP=XADJ(PERM(I)+1)-1
               IF(JSTOP.LT.JSTRT) GOTO 501
                   DO 505 K=JSTRT,JSTOP  
                       IF (INVP(ADJNCY(K)).EQ.J.AND.
     >                   INVP(ADJNCY(K)).LT.I) STR(J)=ZV
505                CONTINUE     
501        CONTINUE
           WRITE(6,503) I,(STR(II),II=1,NPC)
500     CONTINUE      
503     FORMAT(5x,I5,'|',1000(A1,' '))
C-----------------------------------------------------------------------------
C       Структура модифицированной схемы
        CALL FNENV (NP,XADJ,ADJNCY,PERM,INVP,XENV,ENVSZE,BANDW)
C-----------------------------------------------------------------------------            
        WRITE (6,600)NZMTX,MAXLNZ,MAXLNZ-NZMTX,BANDW,NP*(BANDW+1),
     >  ENVSZE+NP,NP+1,ENVSZE+2*NP+1,
     >  NP+MAXLNZ,NP+MAXLNZ,(NP+MAXLNZ)*2,
     >  NP+MAXLNZ,2*NP+MAXSUB,3*NP+MAXLNZ+MAXSUB
600     FORMAT (2X,100("-"),/,
     >  5X,"РАСЧЕТ ЗАТРАТ ПАМЯТИ ДЛЯ РАЗЛИЧНЫХ МЕТОДОВ ХРАНЕНИЯ",/,/,
     >  5x,"Кол-во ненулевых элементов матрица A = ",i7,/,
     >  5x,"Кол-во ненулевых элементов множителя L = ",i7,/,
     >  5x,"Заполнение множителя L:",i7,/,
     >  5X,"Максимальная ширина ленты:",i7,/,/,
     >  5X,"Диагональная схема:",/,
     >  5x,"Полные затраты памяти:",i10,/,/,
     >  5X,"Модифицированная профильная схема:",/,
     >  5x,"Основная память:",I10,/,
     >  5x,"Накладная память:",I10,/,
     >  5x,"Полные затраты памяти:",I10,/,/,
     >  5X,"Обычная схема:",/
     >  5x,"Основная память:",I10,/,
     >  5x,"Накладная память:",I10,/,
     >  5x,"Полные затраты памяти:",I10,/,/,
     >  5X,"Компактная схема хранения",/,     
     >  5x,"Основная память:",i10,/,
     >  5x,"Накладная память:",i10,/,
     >  5x,"Полные затраты памяти:",i10,/,100('-'))
C-----------------------------------------------------------------------------       
        RETURN
        END
C-----------------------------------------------------------------------------
C==============================================================================
C  конец файла MEMCNT.for