C Файл FIND_MIN_ANG.for
C Содержит подпрограмму FIND_MIN_ANG
C =================================================================
C вычисл-е минимального угла в элементе( треуголнике)
C Вызывается из REGULARIZATION, вызываемых модулей нет
C =============================================================
C  входные параметры:
C    CDNTFM - массив координат узлов элемента
C  выходные параметры:
C    MINANG - величина минимального угла
C    MINSD  - длина минимальной стороны
C =================================================================
C ============== начало кода FIND_MIN_ANG ==========================
C =================================================================
      subroutine FIND_MIN_ANG(CDNTFM,MINANG,MINSD)

      DIMENSION CDNTFM(1)
      INTEGER IFM
      REAL SD1,SD2,SD3,TMPSD,MINANG,MINSD,COSA,X1,X2,X3,Y1,Y2,Y3
      DATA NUMVAL/5/

      MINANG=1.571
*      WRITE(6,*) MINANG,SIN(MINANG),ASIN(1.0)
* SD-side
* координаты узлов эл-та (вершин треугольника)
       X1=CDNTFM(1)
       Y1=CDNTFM(2)
       X2=CDNTFM(3)
       Y2=CDNTFM(4)
       X3=CDNTFM(5)
       Y3=CDNTFM(6)
* вычисл-е длин сторон треуголника
       SD1=SQRT((X1-X2)**2 + (Y1-Y2)**2)
       SD2=SQRT((X2-X3)**2 + (Y2-Y3)**2)
       SD3=SQRT((X3-X1)**2 + (Y3-Y1)**2)
*       WRITE(6,*) SD1,SD2,SD3
* SD1 - наименьшая сторона
* определение минимальной стороны
       IF((SD1/SD2).GT.(1.01))THEN
        TMPSD=SD1
        SD1=SD2
        SD2=TMPSD
       ENDIF
       IF((SD1/SD3).GT.(1.01))THEN
        TMPSD=SD1
        SD1=SD3
        SD3=TMPSD
       ENDIF
* по теореме косинусов определяем мин угол
       COSA=(SD2**2+SD3**2-SD1**2)/(2*SD2*SD3)
*       WRITE(6,*) SD1,SD2,SD3,COSA
       MINANG = ACOS((SD2**2+SD3**2-SD1**2)/(2*SD2*SD3))
       MINSD=SD1
*       WRITE(6,*) CURANG,MINANG
        END

C / END FIND_MIN_ANG /
C =================================================================
C ============== конец кода FIND_MIN_ANG ===========================
C =================================================================
C конец файла FIND_MIN_ANG.for