C Файл FINDNODD.for
C Содержит подпрограммы FINDNODD, PROPERTYGRIDDM и PROPERTYFORMDD 
C =============================================================
C    Процедура поиска узлов, лежащих на границе свойств КЭ 
C       вызывается из REGULARIZATION вызываемых модулей нет
C =============================================================
C   NTMOVE массив, хранящий признак возможности перемещения узлов 
C    пластины  при оптимизации.
C     I-ый элемент массива хранит признак для I-ого узла пластины
C    (0 -перемещение разрешено,1 - перемещение запрещено)
C    Число элементов данного массива равно NPM - число узлов пластины
C      CORDDRM - массив координат узлов
C ================================================================
C ================== начало кода FINDNODD ==========================

      SUBROUTINE FINDNODD(NTMOVE,NPM,CORDDRM)

       DIMENSION NTMOVE(1),CORDDRM(1)
       INTEGER NPM,I,MAX1,NTMOVE
       REAL X1,Y1,CORDDRM
C     перебор узлов пластины
       DO 561 I=1,NPM
C  NPM - количество узлов
C  Координаты узла, который обрабатывается в данный момент
       X1=CORDDRM(2*(I-1)+1)
       Y1=CORDDRM(2*(I-1)+2)
C следующие закомментированные строки алгоритма реализованы для Example 3 : 
C если данныйузел лежит на горизонтальной прямой Y=40, или на прямой X=40 
C выше прямой Y=40, то запрещаем движение этого узла при оптимизации сетки.
C       IF (ABS(Y1-40.0).LT.0.001) NTMOVE(I)=1
C       IF (Y1.GE.40.AND.ABS(X1-40.0).LT.0.001) NTMOVE(I)=1
  561  CONTINUE
      return
      end
C ================= конец кода FINDNODD =============================
C ============================================================
C Подпрограмма PROPERTYGRIDDM нвзначения свойств КЭ в отдельных зонах
C       Реализация  свойств КЭ в Griddm  (способ 1)
c      Для Example 3: КЭ зон 7 и 8 присваивается свойство 3
C =================================================================
C ================== начало кода  PROPERTYGRIDDM  ==================

       subroutine  PROPERTYGRIDDM (NRG,NMAT,NEL,IMAT)
        DIMENSION IMAT(1)
C       IF ((NRG.EQ.7).AND.(NMAT.GE.3)) IMAT(NEL) = 3
C       IF ((NRG.EQ.8).AND.(NMAT.GE.3)) IMAT(NEL) = 3 
        RETURN
        END
C =================================================================
C ================== конец кода  PROPERTYGRIDDM  ====================
C =================================================================  
C    Подпрограмма  PROPERTYFORMDD реализации свойств КЭ в Formdd 
C                                   (способ 2 реализации свойств)
C ================================================================
C       Для Example 3: КЭ ниже Y=40 присваиваем свойство 2
C =================================================================
C ============= начало кода  PROPERTYFORMDD  =======================

        subroutine PROPERTYFORMDD (NE,NCN,NMAT,CORD,IMAT,NOP)
        DIMENSION CORD(1),IMAT(1),NOP(1)
         DO 300 I=1,NE
         J=(I-1)*NCN
         DO 400 JJ=1,3
C       IF (NMAT.ge.2.and.(40.0-CORD((NOP(J+JJ)-1)*2+2)).gt.0.01) THEN
C           IMAT(I)=2
C           ENDIF
 400    CONTINUE
 300    CONTINUE
       RETURN
       END
C =============== конец кода  PROPERTYFORMDD =====================
C конец файла  FINDNODD.for