C  файл QMDRCH.for   
C —одержит подпрограмму QMDRCH
C =================================================================
**************************************************************************************
*******   ¬ычисление достижимого множества в алгоритме минимальной степени  
*************************************************************************************************
*     ѕодпрограмма определ€ет достижимое множество узла через
*     данное подмножество. ѕолагаем, что структура смежности
*     хранитьс€ в формате фактор-графа.
* 
*     входные параметры:
*     root - заданный узел вне заданного подмножества.
*     (xadj,adjency) - массивы дл€ структуры смежности.
*     deg - вектор степеней. deg(i).lt.0 означает, что
*        узел i - в данном подмножестве.
* 
*     выходные параметры:
*     (rchsze,rchset) - достижимое множество
*     (nhdsze,nbrhd) - окрестность
* 
*     измен€емые параметры:
*     marker - вектор маркировки дл€ достидимого множества и окресности.
*            положительное значение указывает, что узел в достижимом
*            множестве, отрицательное - был слит с другими или
*            принадлежит окресности.
C =================================================================
C =============== начало кода QMDRCH ==============================
C =================================================================
      SUBROUTINE QMDRCH(ROOT,XADJ,ADJNCY,DEG,MARKER,
     1                        RCHSZE,RCHSET,NHDSZE,NBRHD)
**************************************************************************************************
      integer adjncy(1),deg(1),marker(1),
     1            rchset(1),nbrhd(1)
      integer xadj(1),i,istrt,istop,j,jstrt,jstop,
     1            nabor,nhdsze,node,rchsze,root
*                    
**************************************************************************************************    
*
*            цикл по сосед€м узла root в фактор-графе
*                
      nhdsze=0
      rchsze=0
      istrt=xadj(root)
      istop=xadj(root+1)-1
    ! print*, istrt,istop
      if (istop.lt.istart) return
      do 600 i=istrt, istop
            !print*,adjncy(i)
             nabor=adjncy(i)
             if (nabor.eq.0) return
             if (marker(nabor).ne.0) goto 600
             if (deg(nabor).lt.0) goto 200
*                                    
*                                    включить nabor в достежимое множество
*                        
             rchsze=rchsze+1
            !print*,'##',rchsze
             rchset(rchsze)=nabor
             marker(nabor)=1
             goto 600
*                                    
*                                nabor - исключенный узел. найти узлы, достижимые из него                            
*                                    
200          marker(nabor)=-1
             nhdsze=nhdsze+1
             nbrhd(nhdsze)=nabor
300          jstrt=xadj(nabor)
             jstop=xadj(nabor+1)-1
             do 500 j=jstrt, jstop
                    node=adjncy(j)
                    nabor=-node
                    if(node) 300, 600, 400
400                 if(marker(node).ne.0) goto 500
                    rchsze=rchsze+1
                    rchset(rchsze)=node
                    marker(node)=1
500          continue
600   continue
      return
      end
C =================================================================
C =================== конец кода QMDRCH ============================
C =================================================================
C конец файла QMDRCH.for                         